// **********************************************
// 제 목 : 10-5_2차원 배열
// 날 짜 : 2025년 12월 1일
// 작성자 : 2001485 김선우
// **********************************************
#include <iostream>
using namespace std;

int main() {
    int A[3][3] = {-5, 2, 35, -20, 5, 100, -75, 5, -25};

    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 3; j++) {
            if (A[i][j] < 0)
                A[i][j] = 0;    //인덱스 값이 음수이면 0으로 표기
            else
                A[i][j] = 255;  //양수이면 255
        }
    }

    cout << "수정행렬" << endl;
    for (int i = 0; i < 3; i++) {
        for (int j = 0; j < 3; j++) {
            cout << A[i][j] << " ";
        }
        cout << endl;
    }

    return 0;
}
